src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/CommonModules/ОбщегоНазначенияКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Статусы обмена клиент возвращает список актуальных стасусов обмена
// учитывает уже выбранные значения
//
// Параметры:
//  ТекущийСтатусОбмена	 - 	СписокЗначений - ЭтотОбъект
// 
// Возвращаемое значение:
// СписокЗначений  -  Актуальный Список значений
//
Функция СтатусыОбменаКлиент(ТекущийСтатусОбмена) Экспорт

	АктуальныеСтатусы = Новый Массив;
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.мп_СтатусыОбмена.Создан"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.мп_СтатусыОбмена.КВыгрузкеВКИС"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.мп_СтатусыОбмена.ВыгруженВКИС"));
	АктуальныеСтатусы.Добавить(
		ПредопределенноеЗначение("Перечисление.мп_СтатусыОбмена.ЗагруженИзКИС"));
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого СтатусОбменаКлиент Из АктуальныеСтатусы Цикл
		Пометка = ?(ТекущийСтатусОбмена.НайтиПоЗначению(СтатусОбменаКлиент) = Неопределено, Ложь, Истина);
		СписокВыбора.Добавить(СтатусОбменаКлиент, , Пометка);
	КонецЦикла;

	Возврат СписокВыбора;

КонецФункции

#Область ОповещениеПользователя

// Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// См. ОбщегоНазначения.СообщитьПользователю
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
Процедура СообщитьПользователю(Знач ТекстСообщенияПользователю, Знач КлючДанных = Неопределено,
		Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Сообщение = ОбщегоНазначенияСлужебныйКлиентСервер.СообщениеПользователю(ТекстСообщенияПользователю,
			КлючДанных, Поле, ПутьКДанным, Отказ);
	
	Сообщение.Сообщить()
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
